Examinator/src/InformationRegisters/ОтборыДанныхВебКабинетаСУО_П/ОтборыДанныхВебКабинетаСУО_П.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтборыДанныхВебКабинетаСУО_П</name>
  <attributes>
    <name>ОтборСсылка</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Отбор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ОтборыДанныхВебКабинетаСУО_П/ManagerModule.bsl
Процедура ДобавитьОтбор(Объект, Пользователь, Отбор) Экспорт
	
	ИдентификаторОтбора = Перечисления.ОтборыДанныхВебКабинетаСУО.Идентификатор(Отбор);
	
	НаборЗаписей = РегистрыСведений.ОтборыДанныхВебКабинетаСУО_П.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Отбор.Установить(ИдентификаторОтбора);
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Отбор = ИдентификаторОтбора;
	НоваяЗапись.Объект = Объект;
	НоваяЗапись.Пользователь = Пользователь;
	НоваяЗапись.ОтборСсылка = Отбор;
	НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();

	НаборЗаписей.Записать();	
	
КонецПроцедуры

Процедура УдалитьОтбор(Объект, Пользователь=Неопределено, Отбор=Неопределено) Экспорт	
	
	НаборЗаписей = РегистрыСведений.ОтборыДанныхВебКабинетаСУО_П.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Объект.Установить(Объект);
	
	Если Пользователь <> Неопределено Тогда
		НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	КонецЕсли;
	
	Если Отбор <> Неопределено Тогда
		ИдентификаторОтбора = Перечисления.ОтборыДанныхВебКабинетаСУО.Идентификатор(Отбор);
		НаборЗаписей.Отбор.Отбор.Установить(ИдентификаторОтбора);
	КонецЕсли;	
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
